---
kind: type
id: T:Autodesk.Revit.UI.RibbonPanel
zh: 功能区
source: html/544c0af7-6124-4f64-a25d-46e81ac5300f.htm
---
# Autodesk.Revit.UI.RibbonPanel

**中文**: 功能区

Represents a panel added by an External Application or External Command into the Add-Ins tab.

## Syntax (C#)
```csharp
public class RibbonPanel
```

## Remarks
The Panel class provides read and write access to the RibbonItems contained in the panel. Use of this class is not supported in Revit Macros.